#將 Python 字典轉換為 JSON 字串->跟檔案操作有關
import json
data = [
  {
    "機構名稱": "森美牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "大同里中正路111號1樓、2樓",
    "負責人": "李森孟",
    "電話": "(03)5260203"
  },
  {
    "機構名稱": "黃啟祥牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "和福街105號",
    "負責人": "黃啟祥",
    "電話": "(03)5269095"
  },
  {
    "機構名稱": "福華牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "育英里四維路54號1樓",
    "負責人": "吳英法",
    "電話": "(03)5262345"
  },
  {
    "機構名稱": "親民牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "竹光路２１號",
    "負責人": "黃宏正",
    "電話": "(03)5427027"
  },
  {
    "機構名稱": "如意牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "光田里水田街131號",
    "負責人": "呂正德",
    "電話": "(03)5422765"
  },
  {
    "機構名稱": "僑霖牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "水田街１２０號",
    "負責人": "潘瑞誠",
    "電話": "(03)5330060"
  },
  {
    "機構名稱": "經典牙醫診所",
    "縣市別代碼": "10018",
    "行政區域代碼": "10018020",
    "街道項弄號": "海濱里西濱路一段345號1樓",
    "負責人": "彭奕炘",
    "電話": "(03)5366111"
  },  
]
#將資料轉換成json文件
with open("ch02/files/clinic.json", "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=4)

#讀取json文件
with open("ch02/files/clinic.json", "r", encoding="utf-8") as f:
  #  data = json.load(f)
  #  for item in data:
  #      print(f"{item['機構名稱']}, {item['電話']}")
  
   loaded_data = json.load(f)
   for clinic in loaded_data: #loaded_data是列表，clinic是字典
     for field in clinic: #field是字典clinic裡的鍵
       #每一個輸出需要換行，end="\n"是換行的意思
       print(clinic[field], end="\n") #clinic[field]是字典clinic裡的值
     print("-" * 30) 

  