id = "A123456789"

print(id)
converted_id = "10" + id[1:]
print(converted_id) #10123456789

# sum = 1*1+0*9+1*8+2*7+3*6+4*5+5*4+6*3+7*2+8*1+9*1    #記法：頭尾*1 中間*9、*8....*1依序遞減
sum = 0
for i in range(11):
    if i == 0 or i == 10:
        sum += int(converted_id[i]) * 1
    else:
        sum += int(converted_id[i]) * (10 - i)

# sum % 10 ==0 表示身分證號碼正確
if sum % 10 == 0:
    print("身分證號碼正確")
else:
    print("身分證號碼錯誤")


# area_data = {
#  "臺北市":"A", "臺中市":"B",  "基隆市":"C",  "臺南市":"D", "高雄市":"E", "新北市":"F",
#  "宜蘭縣":"G", "桃園市":"H",  "嘉義市":"I",  "新竹縣":"J", "苗栗縣":"K", "臺中縣":"L",
#  "南投縣":"M", "彰化縣":"N",  "新竹市":"O",  "雲林縣":"P", "嘉義縣":"Q", "臺南縣":"R",
#  "高雄縣":"S", "屏東縣":"T",  "花蓮縣":"U",  "臺東縣":"V", "金門縣":"W",  "澎湖縣":"X",
#  "陽明山管理局":"Y", "連江縣":"Z"
# }
# A=10, B=11, C=12, D=13, E=14, F=15, G=16, H=17, I=34, J=18, K=19, L=20, M=21, N=22, O=35, P=23, Q=24, R=25, S=26, T=27, U=28, V=29, W=32, X=30, Y=31, Z=33



